app/views/points/index.haml

SELECT `points`.* FROM `points` WHERE (`points`.participant_id IN (1,2,3,4,5))
---
          %span.award
            = stars awarded.point_type.value