app/controllers/admin/award_types_controller.rb

SELECT `award_types`.* FROM `award_types`
---
  def index
    @award_types = AwardType.all

SELECT `award_types`.* FROM `award_types` WHERE (`award_types`.`id` = 2) LIMIT 1
---
  def show
    @award_type = AwardType.find(params[:id])

SELECT `award_types`.* FROM `award_types` WHERE (`award_types`.`id` = 2) LIMIT 1
---
  def edit
    @award_type = AwardType.find(params[:id])

INSERT INTO `award_types` (`created_at`, `description`, `name`, `num_points`, `updated_at`) VALUES ('2010-11-02 19:18:06', 'Cash in 100 stars to get a conference of your choice.', 'Conference', 100, '2010-11-02 19:18:06')
---
  def create
    @award_type = AwardType.new(params[:award_type])

    respond_to do |format|
      if @award_type.save

SELECT `award_types`.* FROM `award_types` WHERE (`award_types`.`id` = 2) LIMIT 1
UPDATE `award_types` SET `description` = 'Successfully brew a pot of coffee in the morning for your fellow coworkers.', `name` = 'Make Coffee', `updated_at` = '2011-05-26 15:04:29' WHERE (`award_types`.`id` = 1)
---
  def update
    @award_type = AwardType.find(params[:id])

    respond_to do |format|
      if @award_type.update_attributes(params[:award_type])

SELECT `award_types`.* FROM `award_types` WHERE (`award_types`.`id` = 2) LIMIT 1
DELETE FROM `award_types` WHERE (`award_types`.`id` = 2)
---
  def destroy
    @award_type = AwardType.find(params[:id])
    @award_type.destroy