app/controllers/admin/awards_controller.rb

SELECT `awards`.* FROM `awards`
---
  def index
    @awards = Award.all

SELECT `awards`.* FROM `awards` WHERE (`awards`.`id` = 1) LIMIT 1
---
  def show
    @award = Award.find(params[:id])

SELECT `awards`.* FROM `awards` WHERE (`awards`.`id` = 1) LIMIT 1
---
  def edit
    @award = Award.find(params[:id])

INSERT INTO `awards` (`award_type_id`, `created_at`, `participant_id`, `updated_at`) VALUES (1, '2010-11-02 19:33:37', 6, '2010-11-02 19:33:37')
---
  def create
    @award = Award.new(params[:award])

    respond_to do |format|
      if @award.save

SELECT `awards`.* FROM `awards` WHERE (`awards`.`id` = 1) LIMIT 1
UPDATE `awards` SET `participant_id` = 4, `updated_at` = '2010-11-02 19:35:45' WHERE (`awards`.`id` = 1)
---
  def update
    @award = Award.find(params[:id])

    respond_to do |format|
      if @award.update_attributes(params[:award])

SELECT `awards`.* FROM `awards` WHERE (`awards`.`id` = 3) LIMIT 1
DELETE FROM `awards` WHERE (`awards`.`id` = 3)
---
  def destroy
    @award = Award.find(params[:id])
    @award.destroy