app/controllers/admin/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT `participants`.* FROM `participants`

  def edit
    @participant = Participant.find(params[:id])
---
SELECT `participants`.* FROM `participants` WHERE (`participants`.`id` = 1) LIMIT 1

  def create
    @participant = Participant.new(params[:participant])

    respond_to do |format|
      if @participant.save
---
INSERT INTO `participants` (`created_at`, `name`, `role_id`, `updated_at`) VALUES ('2010-11-02 16:35:34', 'Scott Sampson', 1, '2010-11-02 16:35:34')

  def update
    @participant = Participant.find(params[:id])

    respond_to do |format|
      if @participant.update_attributes(params[:participant])
---
SELECT `participants`.* FROM `participants` WHERE (`participants`.`id` = 1) LIMIT 1
UPDATE `participants` SET `name` = 'Scott Sampsons', `updated_at` = '2010-11-03 21:26:37' WHERE (`participants`.`id` = 1)

  def destroy
    @participant = Participant.find(params[:id])
    @participant.destroy
---
SELECT `participants`.* FROM `participants` WHERE (`participants`.`id` = 2) LIMIT 1
DELETE FROM `participants` WHERE (`participants`.`id` = 2)