app/controllers/admin/point_types_controller.rb

SELECT `point_types`.* FROM `point_types`
---
  def index
    @point_types = PointType.all

SELECT `point_types`.* FROM `point_types` WHERE (`point_types`.`id` = 1) LIMIT 1
---
  def show
    @point_type = PointType.find(params[:id])

SELECT `point_types`.* FROM `point_types` WHERE (`point_types`.`id` = 1) LIMIT 1
---
  def edit
    @point_type = PointType.find(params[:id])

INSERT INTO `point_types` (`created_at`, `description`, `name`, `points`, `updated_at`) VALUES ('2010-11-02 17:41:37', 'If your client is happy after a week of sprints you get 3 gold stars.', 'Client Happy after week of sprints', 3, '2010-11-02 17:41:37')
---
  def create
    @point_type = PointType.new(params[:point_type])

    respond_to do |format|
      if @point_type.save

SELECT `point_types`.* FROM `point_types` WHERE (`point_types`.`id` = 1) LIMIT 1
UPDATE `point_types` SET `description` = 'Cook something in the office so we can all smell it.', `name` = 'That smells delicious', `updated_at` = '2011-06-02 15:24:53', `value` = 8 WHERE (`point_types`.`id` = 2)
---
  def update
    @point_type = PointType.find(params[:id])

    respond_to do |format|
      if @point_type.update_attributes(params[:point_type])

SELECT `point_types`.* FROM `point_types` WHERE (`point_types`.`id` = 2) LIMIT 1
DELETE FROM `point_types` WHERE (`point_types`.`id` = 2)
---
  def destroy
    @point_type = PointType.find(params[:id])
    @point_type.destroy