app/controllers/admin/points_controller.rb

  def index
    @points = Point.all
---
SELECT `points`.* FROM `points`