app/controllers/admin/points_controller.rb

SELECT `points`.* FROM `points` WHERE (`points`.`id` = 1) LIMIT 1
---
  def show
    @point = Point.find(params[:id])

SELECT `participants`.* FROM `participants` WHERE (`participants`.`id` = 5) LIMIT 1
SELECT `point_types`.* FROM `point_types` WHERE (`point_types`.`id` = 1) LIMIT 1
---
  def new
    @point = Point.new
    @participants = Participant.find(:all)
    @point_types = PointType.find(:all)

SELECT `points`.* FROM `points` WHERE (`points`.`id` = 1) LIMIT 1
SELECT `participants`.* FROM `participants`
SELECT `point_types`.* FROM `point_types`
---
  def edit
    @point = Point.find(params[:id])
    @participants = Participant.all
    @point_types = PointType.all

INSERT INTO `points` (`created_at`, `description`, `participant_id`, `point_type_id`, `updated_at`) VALUES ('2010-12-07 21:44:10', 'Worked on 58 phases', 6, 1, '2010-12-07 21:44:10')
---
  def create
    @point = Point.new(params[:point])

    respond_to do |format|
      if @point.save

SELECT `points`.* FROM `points` WHERE (`points`.`id` = 1) LIMIT 1
UPDATE `points` SET `description` = 'test description\'s', `updated_at` = '2011-01-05 17:22:16' WHERE (`points`.`id` = 4)
---
  def update
    @point = Point.find(params[:id])

    respond_to do |format|
      if @point.update_attributes(params[:point])