app/controllers/admin/roles_controller.rb

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 2) LIMIT 1
---
  def show
    @role = Role.find(params[:id])

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 1) LIMIT 1
---
  def edit
    @role = Role.find(params[:id])

INSERT INTO `roles` (`created_at`, `role_name`, `updated_at`) VALUES ('2010-11-02 16:27:10', 'engineer', '2010-11-02 16:27:10')
---
  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 1) LIMIT 1
UPDATE `roles` SET `role_name` = 'engineer\'s', `updated_at` = '2010-11-02 16:30:23' WHERE (`roles`.`id` = 1)
---
  def update
    @role = Role.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 2) LIMIT 1
DELETE FROM `roles` WHERE (`roles`.`id` = 2)
---
  def destroy
    @role = Role.find(params[:id])
    @role.destroy