app/views/admin/points/_form.haml

    %tr
      %td.participant= f.select :participant_id, options_for_select(@participants.collect{|p| [p.name,p.id]}.sort, @point.participant_id)
      %td.pointtype= f.select :point_type_id, options_for_select(@point_types.collect{|pt| [pt.name,pt.id]}.sort, @point.point_type_id)
---
SELECT `participants`.* FROM `participants`
SELECT `point_types`.* FROM `point_types`