app/views/admin/points/_form.html.erb

SELECT `participants`.* FROM `participants`
---
    <%= f.label :participant_id %><br />
    <%= f.select :participant_id, options_for_select(@participants.collect{|p| [p.name,p.id]}.sort,@point.participant_id) %>

SELECT `point_types`.* FROM `point_types`
---
    <%= f.label :point_type_id %><br />
    <%= f.select :point_type_id, options_for_select(@point_types.collect{|pt| [pt.name,pt.id]}.sort,@point.point_type_id) %>