app/views/admin/points/index.haml

SELECT `points`.* FROM `points`
---
      %td.description= point.description
      %td.stars== #{point.point_type.value} stars on