app/views/admin/points/index.html.erb

    <td><%= point.point_type.name %></td>
    <td><%= point.point_type.value %></td>
---
SELECT `points`.* FROM `points`