app/views/admin/participants/_form.html.erb

SELECT `roles`.* FROM `roles`
---
    <%= f.label :role_id %><br />
    <%= f.select :role_id, options_for_select(@roles.collect{|role| [role.role_name,role.id]}.sort) %>