app/controllers/points_controller.rb

  def index

    @participants = Participant.find(:all, :include => :points)
    @score = Participant.scores

    @participants.each do |p|
---
SELECT `points`.* FROM `points` WHERE (`points`.participant_id IN (1,2,3,4,5))
SELECT `participants`.* FROM `participants`
SELECT `points`.* FROM `points`

  def details
    @participant = Participant.find_by_id( params[:id] )
    @points = Point.find_all_by_participant_id( @participant )
    @awards = Award.find_all_by_participant_id( @participant )
---
SELECT `participants`.* FROM `participants` WHERE (`participants`.`id` = 1) LIMIT 1
SELECT `points`.* FROM `points` WHERE (`points`.`participant_id` = 2) LIMIT 1
SELECT `awards`.* FROM `awards` WHERE (`awards`.`participant_id` = 5)