app/views/admin/awards/_form.html.erb

    <%= f.label :participant_id, "Participant" %><br />
    <%= f.select :participant_id, options_for_select(@participants.collect{|p| [p.name,p.id]}.sort,@award.participant_id) %>
---
SELECT `participants`.* FROM `participants`